---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedTemperatureUnit
source: html/186eadd8-7f5d-96f2-46b0-81a0ca82a350.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedTemperatureUnit Property

Undefined temperature unit: '[Temperature Unit Type Name]'

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedTemperatureUnit { get; }
```